## Staging: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 26 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| add      | `aws_ecr_lifecycle_policy.lambda[&quot;AuditLogs-lambda&quot;]`              |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;AuditLogsArchiver-lambda&quot;]`      |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;CognitoEmailSender-lambda&quot;]`     |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;CognitoPreSignUp-lambda&quot;]`       |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;FormArchiver-lambda&quot;]`           |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;Nagware-lambda&quot;]`                |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;NotifySlack-lambda&quot;]`            |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;Reliability-lambda&quot;]`            |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;ReliabilityDlqConsumer-lambda&quot;]` |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;ResponseArchiver-lambda&quot;]`       |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;Submission-lambda&quot;]`             |
|          | `aws_ecr_lifecycle_policy.lambda[&quot;VaultIntegrity-lambda&quot;]`         |
|          | `aws_ecr_repository.lambda[&quot;AuditLogs-lambda&quot;]`                    |
|          | `aws_ecr_repository.lambda[&quot;AuditLogsArchiver-lambda&quot;]`            |
|          | `aws_ecr_repository.lambda[&quot;CognitoEmailSender-lambda&quot;]`           |
|          | `aws_ecr_repository.lambda[&quot;CognitoPreSignUp-lambda&quot;]`             |
|          | `aws_ecr_repository.lambda[&quot;FormArchiver-lambda&quot;]`                 |
|          | `aws_ecr_repository.lambda[&quot;Nagware-lambda&quot;]`                      |
|          | `aws_ecr_repository.lambda[&quot;NotifySlack-lambda&quot;]`                  |
|          | `aws_ecr_repository.lambda[&quot;Reliability-lambda&quot;]`                  |
|          | `aws_ecr_repository.lambda[&quot;ReliabilityDlqConsumer-lambda&quot;]`       |
|          | `aws_ecr_repository.lambda[&quot;ResponseArchiver-lambda&quot;]`             |
|          | `aws_ecr_repository.lambda[&quot;Submission-lambda&quot;]`                   |
|          | `aws_ecr_repository.lambda[&quot;VaultIntegrity-lambda&quot;]`               |
| recreate | `aws_ecr_lifecycle_policy.form_viewer_policy`                      |
|          | `aws_ecr_lifecycle_policy.load_test_policy[0]`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.form_viewer_policy must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "form_viewer_policy" {
      ~ id          = "form_viewer_staging" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ selection    = {
                          - tagPrefixList = [
                              - "v",
                            ]
                          ~ tagStatus     = "tagged" -> "any"
                            # (2 unchanged attributes hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "687401027353" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ecr_lifecycle_policy.lambda["AuditLogs-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "AuditLogs-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["AuditLogsArchiver-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "AuditLogsArchiver-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["CognitoEmailSender-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "CognitoEmailSender-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["CognitoPreSignUp-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "CognitoPreSignUp-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["FormArchiver-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "FormArchiver-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["Nagware-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "Nagware-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["NotifySlack-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "NotifySlack-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["Reliability-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "Reliability-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["ReliabilityDlqConsumer-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "ReliabilityDlqConsumer-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["ResponseArchiver-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "ResponseArchiver-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["Submission-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "Submission-lambda"
    }

  # aws_ecr_lifecycle_policy.lambda["VaultIntegrity-lambda"] will be created
  + resource "aws_ecr_lifecycle_policy" "lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "VaultIntegrity-lambda"
    }

  # aws_ecr_lifecycle_policy.load_test_policy[0] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "load_test_policy" {
      ~ id          = "load_test" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ selection    = {
                          - tagPrefixList = [
                              - "v",
                            ]
                          ~ tagStatus     = "tagged" -> "any"
                            # (2 unchanged attributes hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "687401027353" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ecr_repository.lambda["AuditLogs-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "AuditLogs-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["AuditLogsArchiver-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "AuditLogsArchiver-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["CognitoEmailSender-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "CognitoEmailSender-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["CognitoPreSignUp-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "CognitoPreSignUp-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["FormArchiver-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "FormArchiver-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["Nagware-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "Nagware-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["NotifySlack-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "NotifySlack-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["Reliability-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "Reliability-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["ReliabilityDlqConsumer-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ReliabilityDlqConsumer-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["ResponseArchiver-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ResponseArchiver-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["Submission-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "Submission-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda["VaultIntegrity-lambda"] will be created
  + resource "aws_ecr_repository" "lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "VaultIntegrity-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 26 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + ecr_repository_url_audit_logs_archiver_lambda      = (known after apply)
  + ecr_repository_url_audit_logs_lambda               = (known after apply)
  + ecr_repository_url_cognito_email_sender_lambda     = (known after apply)
  + ecr_repository_url_cognito_pre_sign_up_lambda      = (known after apply)
  + ecr_repository_url_form_archiver_lambda            = (known after apply)
  + ecr_repository_url_nagware_lambda                  = (known after apply)
  + ecr_repository_url_notify_slack_lambda             = (known after apply)
  + ecr_repository_url_reliability_dlq_consumer_lambda = (known after apply)
  + ecr_repository_url_reliability_lambda              = (known after apply)
  + ecr_repository_url_response_archiver_lambda        = (known after apply)
  + ecr_repository_url_submission_lambda               = (known after apply)
  + ecr_repository_url_vault_integrity_lambda          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"AuditLogs-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"AuditLogsArchiver-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"CognitoEmailSender-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"CognitoPreSignUp-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"FormArchiver-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"Nagware-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"NotifySlack-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"Reliability-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"ReliabilityDlqConsumer-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"ResponseArchiver-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"Submission-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.lambda[\"VaultIntegrity-lambda\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.load_test_repository[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.viewer_repository"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
